# 데이터 전처리 과제

* **데이터 설명**
  * 본 데이터는 A대학 도서관에서 제공하는 온라인 DB에 대한 사용자별 이용기록(Transaction)입니다.
  * user_id : 사용자ID
  * region : 지역코드
  * college : 단과대학코드
  * major : 전공코드
  * social_position : 직급코드
  * month : 이용월
  * weekday : 이용요일(1:일요일, 2:월요일, 3:화요일, 4:수요일, 5:목요일, 6:금요일, 7:토요일)
  * hour : 이용시각(24H)
  * DB : 이용 온라인 DB

### 0.0. 필요한 패키지를 로딩하세요

In [1]:
# 넘파이
# 판다스
import numpy as np
import pandas as pd

## 1. 데이터 로딩 및 문제 파악하기

### 1.1. 데이터를 로딩하고 처음 5개의 레코드를 출력하세요.

In [3]:
data_01 = pd.read_csv('DATA_01/DATA_01.csv')

### 1.2. 변수별 데이터 타입을 알아볼 수는 코드를 제시하고 문제점이 있을 경우 서술하세요.

### 1.3. 수치형 변수의 요약 통계량을 제시하세요.

In [ ]:
# describe() 활용

### 1.4. 범주형 변수의 요약 통계량을 제시하세요.

## 2. 데이터의 문제 수정하기

### 2.1. NULL값이 존재하는 변수 중 범주형 변수의 NULL값을 'UNKNOWN'으로 대체하고 처리 결과를 제시하세요.

In [4]:
data_01['major'] = data_01['major'].fillna('UNKNOWN')

### 2.2. NULL값이 존재하는 변수 중 수치형 변수의 NULL값은 제거하고 처리 뒤 데이터의 행과 열을 제시하세요.

In [5]:
data_01 = data_01.dropna(subset=['month'])

## 3. 데이터 파악하기

### 3.1. 전공 중 가장 많은 전공 코드를 제시하세요.

In [6]:
data_01.head()

  user_id region college major social_position  month  weekday  hour     DB
0   U0002    R01   C0002   M09            S005    3.0        3    21  DB048
1   U0003    R01   C0003   M01            S001    3.0        2    12  DB048
2   U0003    R01   C0003   M01            S001    3.0        2    13  DB048
3   U0006    R01   C0001   M11            S005    3.0        2    14  DB055
4   U0005    R01   C0001   M08            S005    3.0        2    14  DB044

In [17]:
#data_01['major'].value_counts()
data_01.major.value_counts().max()

27241

In [11]:
data_01.loc[:,'major'].value_counts()

M04        27241
M11        15435
M08        12536
M09        12331
M05        11500
M01        11086
M03         7433
M06         7343
M07         3564
M02         3021
M10         2888
UNKNOWN     1808
Name: major, dtype: int64

In [14]:
g = data_01.loc[:,'major'].value_counts()
g

M04        27241
M11        15435
M08        12536
M09        12331
M05        11500
M01        11086
M03         7433
M06         7343
M07         3564
M02         3021
M10         2888
UNKNOWN     1808
Name: major, dtype: int64

In [15]:
g.index

Index(['M04', 'M11', 'M08', 'M09', 'M05', 'M01', 'M03', 'M06', 'M07', 'M02',
       'M10', 'UNKNOWN'],
      dtype='object')

In [16]:
g.index[0]

'M04'

### 3.2. 지역이 R02이면서 전공이 M01 이고 오전9시부터 10시까지 사용한 사람은 몇 명인지 제시하세요.

In [20]:
id = ['R02']
qs = "region in @id and major == 'M01' and 9 <= hour <= 10"
data_01.query(qs).region.value_counts()

R02    45
Name: region, dtype: int64

In [21]:
data_01.query(qs).shape

(45, 9)

In [18]:
d1 = data_01.region == 'R02'
d2 = data_01.major == 'M01'
d3 = (data_01.hour >= 9) & (data_01.hour <= 10)
d = d1 & d2 & d3
data_01[d].shape

(45, 9)

In [19]:
data_01[d].head(2)

,user_id,region,college,major,social_position,month,weekday,hour,DB
7014,U1120,R02,C0053,M01,S004,4.0,1,9,DB018
15109,U1899,R02,C0055,M01,S006,5.0,4,10,DB031

### 3.2 에서 구한 내용에서 컬럼명이 user_id, region, major, hour의 리스트를 보여주세요

In [23]:
cols = ['user_id', 'region', 'major', 'hour']
data_01.loc[d, cols].head(3)

      user_id region major  hour
7014    U1120    R02   M01     9
15109   U1899    R02   M01    10
15110   U1899    R02   M01    10

### 3.2 에서 구한 내용에서 컬럼수를 처음부터 6개만 보여주세요.

In [25]:
data_01[d].head(2)

,user_id,region,college,major,social_position,month,weekday,hour,DB
7014,U1120,R02,C0053,M01,S004,4.0,1,9,DB018
15109,U1899,R02,C0055,M01,S006,5.0,4,10,DB031

In [26]:
data_01.iloc[d.values, range(5)].head()

      user_id region college major social_position
7014    U1120    R02   C0053   M01            S004
15109   U1899    R02   C0055   M01            S006
15110   U1899    R02   C0055   M01            S006
15111   U1899    R02   C0055   M01            S006
15325   U1899    R02   C0055   M01            S006

In [27]:
data_01.query(qs).iloc[:, 0:6].head()

      user_id region college major social_position  month
7014    U1120    R02   C0053   M01            S004    4.0
15109   U1899    R02   C0055   M01            S006    5.0
15110   U1899    R02   C0055   M01            S006    5.0
15111   U1899    R02   C0055   M01            S006    5.0
15325   U1899    R02   C0055   M01            S006    5.0

### 3.3. 월요일(weekday = 2)에 가장 빠른 시간에 이용한 기록을 5개 제시하세요.

In [28]:
# 월요일(weekday = 2)
dw = data_01.weekday == 2
data_01[dw].head()

  user_id region college major social_position  month  weekday  hour     DB
1   U0003    R01   C0003   M01            S001    3.0        2    12  DB048
2   U0003    R01   C0003   M01            S001    3.0        2    13  DB048
3   U0006    R01   C0001   M11            S005    3.0        2    14  DB055
4   U0005    R01   C0001   M08            S005    3.0        2    14  DB044
5   U0007    R01   C0001   M08            S005    3.0        2    14  DB044

In [30]:
# 가장 빠른 시간
data_01[dw]['hour'].min()

0

In [31]:
dh = data_01.hour == 0
ds = dw & dh
data_01[ds].head()

    user_id region college major social_position  month  weekday  hour     DB
235   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
236   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
237   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
238   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
239   U0131    R02   C0031   M07            S004    3.0        2     0  DB031

In [32]:
# 정하협
data_01.head()

  user_id region college major social_position  month  weekday  hour     DB
0   U0002    R01   C0002   M09            S005    3.0        3    21  DB048
1   U0003    R01   C0003   M01            S001    3.0        2    12  DB048
2   U0003    R01   C0003   M01            S001    3.0        2    13  DB048
3   U0006    R01   C0001   M11            S005    3.0        2    14  DB055
4   U0005    R01   C0001   M08            S005    3.0        2    14  DB044

In [33]:
e = data_01['weekday'] == 2
data_04 = data_01[e].copy()

In [34]:
data_04.shape

(19438, 9)

In [36]:
data_04.nsmallest(19438, 'hour')

,user_id,region,college,major,social_position,month,weekday,hour,DB
37710,U0036,R01,C0001,M04,S006,9.0,2,0,DB048
91566,U5394,R01,C0008,M09,S004,12.0,2,0,DB018
86484,U0072,R01,C0001,UNKNOWN,S006,10.0,2,0,DB018
112339,U3212,R01,C0035,M04,S004,11.0,2,0,DB031
86483,U2913,R01,C0008,M09,S004,10.0,2,0,DB064
...,...,...,...,...,...,...,...,...,...
8861,U1747,R01,C0001,M04,S005,4.0,2,30,DB021
52874,U1008,R01,C0002,M09,S005,12.0,2,30,DB031
52772,U3449,R01,C0001,M08,S006,12.0,2,30,DB027
113242,U2381,R01,C0006,M11,S004,11.0,2,30,DB031
92426,U0018,R01,C0006,M11,S004,12.0,2,30,DB060

In [37]:
data_04.nsmallest(5, 'hour')

    user_id region college major social_position  month  weekday  hour     DB
235   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
236   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
237   U0003    R01   C0003   M01            S001    3.0        2     0  DB048
238   U0129    R01   C0030   M10            S002    3.0        2     0  DB077
239   U0131    R02   C0031   M07            S004    3.0        2     0  DB031

In [39]:
data_04.sort_values('hour', ascending=True).head()

,user_id,region,college,major,social_position,month,weekday,hour,DB
37710,U0036,R01,C0001,M04,S006,9.0,2,0,DB048
91566,U5394,R01,C0008,M09,S004,12.0,2,0,DB018
86484,U0072,R01,C0001,UNKNOWN,S006,10.0,2,0,DB018
112339,U3212,R01,C0035,M04,S004,11.0,2,0,DB031
86483,U2913,R01,C0008,M09,S004,10.0,2,0,DB064